Autodesk.Revit.DB.Structure.RebarInSystem.CanEditIndividualBars
Checks if individual bars can be moved, excluded or included.
Remarks:
Individual bars can be moved, exlucded or included only for RebarInSystem that is owned by PathReinforcement. For RebarInSystem owned by AreaReinforcement these operations are not supported.
Returns:
True if individual bars can be moved, excluded or included, false otherwise.
Since:
2022

Autodesk.Revit.DB.Structure.RebarInSystem.GetBarIndexFromReference(Autodesk.Revit.DB.Reference)
Given a reference that represents a part of a bar, this method will return the bar index.
Remarks:
The method returns an index between 0 and NumberOfBarPositions - 1 if it the given reference represents a part of a bar.
Otherwise will return -1.
barReference:
The Reference of the RebarInSystem element.
Returns:
The bar index the reference refers to.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.Structure.RebarInSystem.ResetMovedBarTransform(System.Int32)
Reset the transformation representing the movement of the bar relative to its default position along the distribution path.
The moved bar transform will be set to Identity.
barPositionIndex:
The bar index.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
For this RebarInSystem element individual bars can't be moved, excluded or included.
Since:
2022

Autodesk.Revit.DB.Structure.RebarInSystem.GetMovedBarTransform(System.Int32)
Returns a transform representing the movement of the bar relative to its default position along the distribution path.
Remarks:
For a RebarInSystem for which individual bars can't be edited (the ones owned by AreaReinforcement) the identity transform is returned.
barPositionIndex:
The bar index.
Returns:
The transform representing the movement of the bar relative to its default position along the distribution path.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2022

Autodesk.Revit.DB.Structure.RebarInSystem.MoveBarInSet(System.Int32,Autodesk.Revit.DB.Transform)
This method applies the transformation matrix to the rebar bar at the desired position in the rebar set.
If the bar was already moved, the method will concatenate the transformation matrix with the existing movement.
barPositionIndex:
The bar index of the rebar to apply the transformation.
moveTransform:
The transformation matrix to apply to the specified rebar bar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
For this RebarInSystem element individual bars can't be moved, excluded or included.
Since:
2022

Autodesk.Revit.DB.Structure.RebarInSystem.DoesBarExistAtPosition(System.Int32)
Checks whether a bar is included at the specified position.
barPosition:
A bar position index between 0 and NumberOfBarPositions-1.
Returns:
Returns true if the bar at the specified position is included, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPosition is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.SetBarIncluded(System.Boolean,System.Int32)
Sets if the bar at the desired index is included or not.
include:
True to include the bar, false to exclude the bar.
barPositionIndex:
The bar index.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
For this RebarInSystem element individual bars can't be moved, excluded or included.
Since:
2022

Autodesk.Revit.DB.Structure.RebarInSystem.SetUnobscuredInView(Autodesk.Revit.DB.View,System.Boolean)
Sets  RebarInSystem element to be shown unobscured in a view.
view:
The view element
unobscured:
True if  RebarInSystem element is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This element doesn't have valid visibility data.
Since:
2014

Autodesk.Revit.DB.Structure.RebarInSystem.IsUnobscuredInView(Autodesk.Revit.DB.View)
Checks if this rebar element is shown unobscured in a view.
view:
The view element
Returns:
True if rebar is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.CanApplyPresentationMode(Autodesk.Revit.DB.View)
Checks if a presentation mode can be applied for this rebar in the given view.
dBView:
The view in which presentation mode will be applied.
Returns:
True if a presentation mode can be applied for the given view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.ClearPresentationMode(Autodesk.Revit.DB.View)
Sets the presentation mode for this rebar set to the default (either for a single view, or for all views).
dBView:
The view where the presentation mode will be cleared. NULL for all views
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.FindMatchingPredefinedPresentationMode(Autodesk.Revit.DB.View)
Determines if there is a matching RebarPresentationMode for the current set of selected hidden and unhidden bars assigned to the given view.
Remarks:
If the presentation mode is not PresentationMode.Select for the view, this function returns the current mode.
dBView:
The view.
Returns:
The presentation mode that matches the current set of selected hidden and unhidden bars.
If there is no better match, this returns RebarPresentationMode.Select.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.GetPresentationMode(Autodesk.Revit.DB.View)
Gets the presentaion mode for this rebar set when displayed in the given view.
dBView:
The view.
Returns:
The presentation mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.SetPresentationMode(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Structure.RebarPresentationMode)
Sets the presentation mode for this rebar set when displayed in the given view.
dBView:
The view.
presentationMode:
The presentation mode.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This rebar cannot have a presentation mode applied for dBView, as the view is not valid for rebar presentation,
or the orientation of the view matches the normal direction of the rebar element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.HasPresentationOverrides(Autodesk.Revit.DB.View)
Identifies if this RebarInSystem has overridden default presentation settings for the given view.
Remarks:
Default presentation settings can be overriden using Autodesk.Revit.DB.Structure.RebarInSystem.SetBarHiddenStatus(Autodesk.Revit.DB.View,System.Int32,System.Boolean), Autodesk.Revit.DB.Structure.RebarInSystem.SetPresentationMode(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Structure.RebarPresentationMode) methods
dBView:
The view.
Returns:
True if this RebarInSystem has overriden default presentation settings, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.IsRebarInSection(Autodesk.Revit.DB.View)
Identifies if this RebarInSystem is cut by the view plane of the given view.
Remarks:
This method applies only for elevations and sections. For any other view types will return false.
dBView:
The view.
Returns:
True if this RebarInSystem is cut by the view plane, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.IsBarHidden(Autodesk.Revit.DB.View,System.Int32)
Identifies if a given bar in this rebar set is hidden in this view.
view:
The view.
barIndex:
The index of the bar from this rebar set.
Returns:
True if the bar is hidden in this view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.SetBarHiddenStatus(Autodesk.Revit.DB.View,System.Int32,System.Boolean)
Sets the bar in this rebar set to be hidden or unhidden in the given view.
Remarks:
Individual bars of a rebar set can be hidden in a view only
if the presentation mode is RebarPresentationMode.Select.
If that is not the presentation mode assigned for this set in the view,
this method will also change it.
view:
The view.
barIndex:
The index of the bar from this set.
hide:
True to hide this bar in the view, false to unhide the bar.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This rebar cannot have a presentation mode applied for view, as the view is not valid for rebar presentation,
or the orientation of the view matches the normal direction of the rebar element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.GetReinforcementRoundingManager
Returns an object for managing reinforcement rounding override settings.
Returns:
The rounding manager.
Since:
2014

Autodesk.Revit.DB.Structure.RebarInSystem.GetTransformedCenterlineCurves(System.Boolean,System.Boolean,System.Boolean,System.Int32)
A chain of curves representing the centerline of the rebar.
Remarks:
This method will return the centerline curves for bar at barPositionIndex even if this bar isn't included.
The curves are in the final position. The BarPositionTransform (representing the relative position of any individual bar in the set - a translation along the distribution path)
and MovedBarTransform (representing the movement of the bar relative to its default position along the distribution path) will be applied to the returned curves.
adjustForSelfIntersection:
If the curves overlap, as in a planar stirrup, this parameter controls
whether they should be adjusted to avoid intersection (as in fine views),
or kept in a single plane for simplicity (as in coarse views).
suppressHooks:
Identifies if the chain will include hooks curves.
suppressBendRadius:
Identifies if the connected chain will include unfilleted curves.
barPositionIndex:
The bar index.
Returns:
The centerline curves or empty array if the curves cannot be computed because
the parameters values are inconsistent
with the constraints of the RebarShape definition.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2022

Autodesk.Revit.DB.Structure.RebarInSystem.GetCenterlineCurves(System.Boolean,System.Boolean,System.Boolean)
A chain of curves representing the centerline of the rebar.
Remarks:
This method will return the centerline curves for the first bar in set even if this bar isn't included.
adjustForSelfIntersection:
If the curves overlap, as in a planar stirrup, this parameter controls
whether they should be adjusted to avoid intersection (as in fine views),
or kept in a single plane for simplicity (as in coarse views).
suppressHooks:
Identifies if the chain will include hooks curves.
suppressBendRadius:
Identifies if the connected chain will include unfilleted curves.
Returns:
The centerline curves or empty array if the curves cannot be computed because
the parameters values are inconsistent
with the constraints of the RebarShape definition.
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.Quantity
Identifies the number of bars in rebar set.
Remarks:
Quantity is equal to NumberOfBarPositions if all the bars are included.
If any bars are excluded, they are not counted in the Quantity.
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.ScheduleMark
The Schedule Mark parameter. On creation, the Schedule Mark is set
to a value that is unique to the host, but it can be set to
any value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013